Revit 2026 API

# IFCLegacyStairOrRamp Methods

---

The IFCLegacyStairOrRamp type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundaryLines | Gets boundary lines. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLandingGeometries | Gets the geometries of landings. |
|  | GetNumberOfRisers | Gets the number of risers. |
|  | GetNumberOfTreads | Gets the number of treads. |
|  | GetRunGeometries | Gets the geometries of runs. |
|  | GetStringerGeometries | Gets the geometries of stringers. |
|  | GetTreadsLength | Gets the length of treads. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWalkLines | Gets walk lines. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCLegacyStairOrRamp Class

Autodesk.Revit.DB.IFC Namespace